<template>
  <div class="userAgreement">
    <p class="title">雅培用户购买协议</p>
    <p>
      在您购买上述产品之前，请仔细阅读并决定是否接受以下内容。您理解并同意，当您付款并购买上述产品时，即表示您完全同意并接受以下全部内容：
    </p>
    <br />
    <p>
      个人信息系指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。对于您通过公众号【糖友惠】渠道提供给上海友义药房有限公司（以下称“友义药房”）的所有个人信息，包括但不限于有关自然人的姓名、电话号码、联系方式、电子邮箱等，您授权友义药房将该等个人信息提供给雅培贸易（上海）有限公司（及其关联公司，以下合称“雅培”），以便雅培使用该等个人信息：进行研究/分析以改进雅培提供的产品和/或服务；以电话、电子邮件、短信和/或邮件等方式（在适用的范围内）提供有关疾病、治疗以及产品和服务的相关资讯；邀请相关人员参加产品调查；以及进行相关产品的营销和宣传。雅培将仅为前述目的而收集、使用、存储和处理您提供的个人信息；如雅培要将信息用于其它用途时，会事先征求您的同意。您理解并同意雅培为上述用途可将上述个人信息分享给其关联公司和/或雅培指定的其他公司进行处理和储存。您同意基于该等用途上述个人信息可能会被传送至其他国家和地区（例如：马来西亚、新加坡和/或美国）进行处理和储存。雅培将确保不会将上述个人信息出售给任何第三方以谋取不正当利益。您确认您有权提供上述个人信息并作出上述授权，并将自行对该等信息的真实性、准确性和有效性负责。
    </p>
    <br />
    <p>
      雅培将为您通过友义药房提供给雅培的个人信息保密，但雅培可能出于上文所述目的而将该等个人信息披露给：（1）为雅培提供有关运营服务或意见的任何人员、代理、顾问、审计师、承包商或服务人员；（2）任何与雅培有业务往来的雅培关联方；以及（3）任何对雅培负有保密责任的机构或人员。如果雅培出售某个产品线或业务部门，该等个人信息可能被转移给买方，以便买方继续为您提供信息和服务。另外，雅培保留因回应政府机构的官方要求、回应国家安全问题、或根据法律要求而披露您个人信息的权利。
    </p>
    <br />
    <p>
      一般而言，雅培仅保留该等个人信息至履行上述用途所需的期限，同时将遵守适用法律法规规定的数据保留期限。
    </p>
    <br />
    <p>
      如果您希望删除、补充或更正提供给雅培的个人信息，请通过以下方式和雅培联系：【400-0820-567】。如您希望雅培删除个人信息，在收到您通过上述联系方式提出的请求后，雅培会及时删除该等个人信息，除非法律法规或政府部门的相关要求另有规定；但由于操作流程的关系，您在个人信息删除后的一段时间内仍可能会继续收到雅培提供的信息。如果您对所提供之个人信息的使用、修改或删除有任何疑问，或希望以后不再接收雅培向您提供的特定信息，也请通过前述方式和雅培联系，雅培将尽力及时答复您的所有合理请求。
    </p>
    <br />
    <p>
      在法律许可或在不侵犯您的法定权利的范围内，雅培保留不经事先通知您而修改、增加或删除本文件或其任何部分的权利。如果雅培更改了关于隐私的实践操作，我们将在更新版本的文件中体现这些更改。
    </p>
    <!-- <qrcode></qrcode> -->
    <!-- <htmlToCanvas></htmlToCanvas> -->
  </div>
</template>

<script>
// import qrcode from '@/components/qrcode'
// import htmlToCanvas from '@/components/htmlToCanvas'
export default {
  name: 'UserAgreement',
  data() {
    return {
      imgPic: ''
    }
  },
  mounted() {},
  components: {}
  // components: { qrcode, htmlToCanvas }
}
</script>

<style lang="less" scoped>
.userAgreement {
  .title {
    text-align: center;
    font-size: 18px;
    line-height: 60px;
  }
  p {
    line-height: 25px;
    text-indent: 2em;
    padding: 0 13px;
  }
}
</style>
